       LINKAGE SECTION.
       01 LINK-DADOS.
          02 LID-ARQ-CLIENTE.
             03 LID-ARQ-CLIENTE-1            PIC X(50).
       
          02 LID-ARQ-VENDEDOR.
             03 LID-ARQ-VENDEDOR-1           PIC X(50).
 
          02 LID-ARQ-DISTRIBUICAO.
             03 LID-ARQ-DISTRIBUICAO-1       PIC X(50).
          
          02  LINK-CPFCGC                    PIC X(20).